:PROPERTIES:
:ID:       2c06fba7-342c-42ba-a063-176b6c3c8a4d
:END:
#+title: 类大小/类对象内存模型
#+filetags: cpp

* 类大小(结构体大小)的影响因素 [[https://www.bilibili.com/video/BV1akQ5YwEYt/?spm_id_from=333.337.search-card.all.click&vd_source=4441bc96046659b39d059d583f36ff52][bilibili-程序员陈子青]]
- static成员变量 :: 存储在全局区，不占类对象大小 [fn:1]
- 虚函数         :: 虚函数表指针：8 字节 [fn:2]
- 虚继承         :: [[id:9f071537-cd60-49c4-97bc-47e3474b7c2e][虚基类]]指针：8 字节 [fn:3]
- 内存对齐规则   :: 类大小为最大成员变量数据类型的倍数，类大小没达到就填充字节 [fn:4] [[https://www.learncpp.com/cpp-tutorial/struct-miscellany/][learncpp13.11]]
  -> *作用* ：编译器为了 *优化内存访问效率*
- 空类           :: 1 字节，用于区分空类对象 [fn:5]


* 类对象内存模型
单继承、多继承、虚函数、虚继承


* Footnotes

[fn:1]
#+name: static
#+begin_src cpp :results output :namespaces std :includes <iostream>
class A {
  static int a; // 全局数据区，不占类大小
  int c;        // 4字节
  int i;        // 4字节
};

int main() {
  cout << sizeof(A) << '\n';
}
#+end_src

#+RESULTS:
: 8

[fn:2]
#+name: 虚函数
#+begin_src cpp :results output :namespaces std :includes <iostream>
class A
{
  // VirtualTable* __vptr;           // 8字节（虚函数表指针）
  int x;                             // 4字节 -> 4 + 4
  virtual void f() {}
};

int main() {
  cout << sizeof(A) << '\n';
}
#+end_src

#+RESULTS: 虚函数
: 16

[fn:3]
#+name: 虚继承
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Base
{
  double a;          // 8字节
};

class Derived : virtual public Base // g++ 为24；MSVC 为36
{
  // vbptr           // 8字节（虚基类指针）
  int b;             // 4字节 -> 4 + 4
  // double a;       // 8字节（继承来的成员变量）
  // NOTE 通过虚基类指针找到对应的虚基类表，虚基类表中存储了偏移量，通过偏移量找到最基类的成员变量
  // NOTE 示例：A，BC虚继承A，D直接继承BC
  // B、C、D都有各自的 虚基类指针、虚基类表；创建D对象时，由D负责直接初始化A，访问A中成员变量时，D -> 虚基类指针 -> 虚基类表 -> 偏移量 -> 访问成功

  // class base      // 8字节（MSVC的特殊机制：父类内存大小的缓存空间）
};

int main() {
  cout << sizeof(Derived) << '\n';
}
#+end_src

#+RESULTS: 虚继承
: 24

[fn:4]
#+name: 内存对齐
#+begin_src cpp :results output :namespaces std :includes <iostream>
struct A          // A总大小填充为 8的倍数 -> 16
{
    short a {};   // 2字节 -> 2 + 2
    int b {};     // 4字节
    double c {};  // 8字节
};

class B           // B总大小填充为 8的倍数 -> 24
{
  char a;         // 1字节 -> 1 + 7
  double b;       // 8字节
  int c;          // 4字节 -> 4 + 4
};

class C           // C总大小填充为 8的倍数 -> 16
{
  double b;       // 8字节
  char a;         // 1字节 -> 1 + 3
  int c;          // 4字节 ->
};

[fn:5]
#+name: 空类大小
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Empty {}; // 1字节：用于区分空类对象（cpp标准要求每个对象独立唯一的内存地址；若空类大小为0字节，多个空类实例就无法拥有不同地址）

int main() {
  cout << sizeof(Empty) << '\n';
}
#+end_src

#+RESULTS: 空类大小
: 1
